# Introduction to Pandas dataframe

> 1. Data frame is a main object in pandas. It is used to represent data with rows and columns
> 2. Data frame is a datastructure represent the data in tabular or excel spread sheet like data)

#### creating dataframe:

In [ ]:
# table = 'data.csv' # read into table  5-10 lines of code
# heights = table['height']
# N = len(heights)
# sum = 0.0
# for h in heights:
#   sum += h
# average = sum/N

# print(table['height'].mean())

In [24]:
import pandas as pd
df = pd.read_csv('weather_data.csv')
print(df)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [25]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [28]:
#Another way to view data frame as list of tuples
weather_data = [('1/1/2017', 32, 6, 'Rain'),
                ('1/2/2017', 35, 7, 'Sunny'),
                ('1/3/2017', 28, 2, 'Snow'),
                ('1/4/2017', 24, 7, 'Snow'),
                ('1/5/2017', 32, 4, 'Rain'),
                ('1/6/2017', 31, 2, 'Sunny')
               ]
# weather data is a list of tuples 
df = pd.DataFrame(weather_data, columns=['Date', 'temperature', 'windspeed', 'event'])
df # this is a data frame coneverted by pd.DataFrame() function

       Date  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [31]:
df.head() # returns first 5 elements of data frame

       Date  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [ ]:
df.tail(2) # returns last 2 elements of data frame

        day  temperature  windspeed  event
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
df[2:4] # prints elements from index 2 to 4

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow

In [34]:
df.columns # Prints columns of data frame

Index(['Date', 'temperature', 'windspeed', 'event'], dtype='object')

In [35]:
listofColumns = list(df.columns)
listofColumns

['Date', 'temperature', 'windspeed', 'event']

In [40]:
df['temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [39]:
df.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [41]:
eventSeries = df.event # returns day column from df
type(eventSeries)

pandas.core.series.Series

In [ ]:
eventSeries[0] = 'Cow'

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6    Cow
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
eventSeries = df.event.copy()

In [ ]:
eventSeries[0] = 'Hen'

In [ ]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6    Cow
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
eventSeries

0      Hen
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [ ]:
l = df.windspeed # returns windspeed column from df
type(l)

pandas.core.series.Series

In [45]:
df[['Date', 'event']] # returns two columns mentioned

       Date  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [ ]:
df['temperature'].mean() # returns mean of temperature column

30.333333333333332

In [46]:
df.temperature.mean()

30.333333333333332

In [ ]:
df['temperature'].max() # returns max of temperature column

35

In [ ]:
df['temperature'].describe() # Returns statistical information of mentioned columns

count     6.000000
mean     30.333333
std       3.829708
min      24.000000
25%      28.750000
50%      31.500000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [ ]:
df[['temperature', 'windspeed']].describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [48]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [ ]:
df[df.temperature == df['temperature'].max()] # select rows which has maximum temperature

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [ ]:
df.temperature == df['temperature'].max()

0    False
1     True
2    False
3    False
4    False
5    False
Name: temperature, dtype: bool

In [ ]:
df.day[df.temperature == df['temperature'].max()] #select only day column which has maximum temperature

1    1/2/2017
Name: day, dtype: object

# Read and write CSV and XLS files

In [ ]:
import pandas as pd
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
#INSTALL: pip3 install xlrd
#read excel file 
df = pd.read_excel('weather_data.xlsx')
print(df)
type(df['temperature'].values) # values give numpy array

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

pandas.core.series.Series

1. As you can observe both files created using below functions df.to_csv()
2. By default a column is inserted at the time of csv file creation i.e. index column starting eith 0
3. To avoid this column you may add argument as index =False

In [ ]:
#write DF to csv
df.to_csv('new1.csv') # new.csv file created and data frame df will be stored in it
df.to_csv('new_noIndex.csv', index=False) # new_noIndex.csv file created and data frame df will be stored in it

In [ ]:
# INSTALL: pip3 install openpyxl
#write DF to Excel
df.to_excel('new.xlsx', sheet_name='weather_data') 
# A new.xlsx file created. An excel sheet may have multiple sheets we can name the sheets as well

In [ ]:
import pandas as pd
df = pd.read_csv('weather_data_cities.csv')
df #weather by cities

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [ ]:
groups = df.groupby('city')
print(groups) # this will not print data

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fc8e3f94240>

> 1. When groupby method used on data frame it groups the data frame according to the cities.
> 2. So two columns are returned first city name and second column conrtains data frame w.r.t. that city

1. city 
  > dataframe
2. city
  > dataframe
3. city
  > dataframe
    .
    .
    .
    .
    
To print values of groups we have to use for loop to print city and respective dataframe

In [ ]:
for city, city_frame in groups:   # city as first dimension and city_frame as second dimensiosn
    print(city) 
    print(city_frame)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [ ]:
cityTempMean = df.groupby('city')['temperature'].mean()
cityTempMean

city
mumbai      88.50
new york    32.25
paris       47.75
Name: temperature, dtype: float64

In [ ]:
# To get only one group of data
groups.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [ ]:
groups.get_group('paris') #describe()

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [ ]:
groups.max() # returns max value of every column for each city

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [ ]:
groups.mean() # only numerical valued columns are considered

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [ ]:
# To print all statistical data w.r.t. each city
groups.describe()

         temperature                         ... windspeed
               count   mean       std   min  ...       25%   50%    75%   max
city                                         ...
mumbai           4.0  88.50  3.109126  85.0  ...      5.00   8.5  12.75  15.0
new york         4.0  32.25  3.304038  28.0  ...      6.75   7.0   8.25  12.0
paris            4.0  47.75  5.315073  42.0  ...      9.50  11.5  14.75  20.0

[3 rows x 16 columns]

## concatenate Data Frames

In [ ]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ['mumbai','delhi','Kolkata'],
    "temperature": [50,55,60],
    "humidity": [43,65,87]   
})

# this way we can create a data frame. Note that inside data frame we have dictionary i.e. key value pair
india_weather

      city  temperature  humidity
0   mumbai           50        43
1    delhi           55        65
2  Kolkata           60        87

In [ ]:

us_weather = pd.DataFrame({
    "city": ['new york','san diago','chicago'],
    "temperature": [50,55,60],
    "humidity": [43,65,87]   
})

# this way we can create a data frame. Note that inside data frame we have dictionary i.e. key value pair
us_weather

        city  temperature  humidity
0   new york           50        43
1  san diago           55        65
2    chicago           60        87

In [ ]:
df = pd.concat([india_weather,us_weather])
df
# Note that indices from both dfs are copied as it is

        city  temperature  humidity
0     mumbai           50        43
1      delhi           55        65
2    Kolkata           60        87
0   new york           50        43
1  san diago           55        65
2    chicago           60        87

In [ ]:
# avoid index term
df1 = pd.concat([india_weather,us_weather], ignore_index = True)
df1
# now indices are

        city  temperature  humidity
0     mumbai           50        43
1      delhi           55        65
2    Kolkata           60        87
3   new york           50        43
4  san diago           55        65
5    chicago           60        87

In [ ]:
df2 = pd.concat([india_weather, us_weather],axis = 1) 
df2 # axis = 0 concates row wise and axis = 1 concates column wise

      city  temperature  humidity       city  temperature  humidity
0   mumbai           50        43   new york           50        43
1    delhi           55        65  san diago           55        65
2  Kolkata           60        87    chicago           60        87

## Merging of two data frames
This almost works like join query

In [ ]:
import pandas as pd
temp = pd.DataFrame({
    "city": ['Mumbai', 'Delhi', 'Kolkata'],
    "temperature": [42, 37, 44]    
}) # Temperature data frame contains temperature of cites
temp

      city  temperature
0   Mumbai           42
1    Delhi           37
2  Kolkata           44

In [ ]:
hum = pd.DataFrame({
     "city": ['Mumbai', 'Delhi', 'Kolkata'],
    "humidity": [43,56,87]
})
hum

      city  humidity
0   Mumbai        43
1    Delhi        56
2  Kolkata        87

In [ ]:
df = pd.merge(temp,hum,on='city')
df

      city  temperature  humidity
0   Mumbai           42        43
1    Delhi           37        56
2  Kolkata           44        87

In [ ]:
wind = pd.DataFrame({
    "city": ['Mumbai', 'Delhi', 'Benglore'],
    "wind": [122,154,121] 
})

In [ ]:
df2 = pd.merge(temp,wind,on='city') # deault join note the cities in final merged output
df2                                 # by default it applies inner join

     city  temperature  wind
0  Mumbai           42   122
1   Delhi           37   154

In [ ]:
df3 = pd.merge(temp,wind,on='city', how='outer') # default join note the cities in final merged output
df3

       city  temperature   wind
0    Mumbai         42.0  122.0
1     Delhi         37.0  154.0
2   Kolkata         44.0    NaN
3  Benglore          NaN  121.0

## Indexing in a data frame

In [ ]:
df = pd.DataFrame({"Key": [22,33,21,34,24,13,13,434,545,676]})
df
# as you can observe below separate indices are provided starting with 0
# These can also be referred as row numbers 
# you can also assign your own idices

   Key
0   22
1   33
2   21
3   34
4   24
5   13
6   13
7  434
8  545
9  676

In [ ]:
# You can also use your own indices rather than defaults
df = pd.DataFrame({"Key":[22,33,21,34,24,13,13,434,545,676]}, index = [10,9,5,7,6,54,4,3,2,1])
df

    Key
10   22
9    33
5    21
7    34
6    24
54   13
4    13
3   434
2   545
1   676

In [ ]:
# To access data frame entries using index number, use loc[]

df.loc[:5]

    Key
10   22
9    33
5    21

In [ ]:
# To access data frame entries using index number, use iloc[]
df.iloc[:5]

    Key
10   22
9    33
5    21
7    34
6    24

In [ ]:
temp.iloc[2]

city           Benglore
temperature          44
Name: 2, dtype: object

In [ ]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [ ]:
data.loc[0,:] # Retrive all columns of row 0 
# First entry is row index and next is columns

age                     10
section                  A
city               Gurgaon
gender                   M
favourite_color        red
Name: 0, dtype: object

In [ ]:
data.loc[[0,1,3],:]  # row number 0, 1, 3 and all columns

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
3   21       B    Delhi      M             NaN

In [ ]:
data.loc[0:3, ['city','gender']]

      city gender
0  Gurgaon      M
1    Delhi      F
2   Mumbai      F
3    Delhi      M

In [ ]:
# select all cities with all rows
data.loc[:,'city']

0    Gurgaon
1      Delhi
2     Mumbai
3      Delhi
4     Mumbai
5      Delhi
6     Mumbai
Name: city, dtype: object

In [ ]:
data.city[0:6]

0    Gurgaon
1      Delhi
2     Mumbai
3      Delhi
4     Mumbai
5      Delhi
Name: city, dtype: object

In [ ]:
data.loc[:, 'age':'gender']

   age section     city gender
0   10       A  Gurgaon      M
1   22       B    Delhi      F
2   13       C   Mumbai      F
3   21       B    Delhi      M
4   12       B   Mumbai      M
5   11       A    Delhi      M
6   17       A   Mumbai      F

In [ ]:
data.loc[data.gender == 'M']

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green

In [ ]:
# calculate mean of age for male
data.loc[data.gender == 'M']['age'].mean()

13.5

In [ ]:
data.loc[data.gender == 'M', ['gender','city']]

  gender     city
0      M  Gurgaon
3      M    Delhi
4      M   Mumbai
5      M    Delhi

In [ ]:
# select all rows with a condition
data.loc[data.age >= 15]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red

In [ ]:
data.loc[(data.age >= 12) & (data.gender == 'M')]

   age section    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black

In [ ]:
#slice
data.loc[1:3]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
2   13       C  Mumbai      F          yellow
3   21       B   Delhi      M             NaN

In [ ]:
# select few columns with a condition
data.loc[(data.age >= 12), ['city', 'gender']]

     city gender
1   Delhi      F
2  Mumbai      F
3   Delhi      M
4  Mumbai      M
6  Mumbai      F

In [ ]:
# update a column with condition
data.loc[(data.age >= 12), ['section']] = 'M'
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       M    Delhi      F             NaN
2   13       M   Mumbai      F          yellow
3   21       M    Delhi      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [ ]:
# update multiple columns with condition
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Pune']
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       M   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [ ]:
data.iloc[:,0:3] # in iloc we can specify integer index for columns also

   age section     city
0   10       A  Gurgaon
1   22       S     Pune
2   13       M   Mumbai
3   21       S     Pune
4   12       M   Mumbai
5   11       A    Delhi
6   17       M   Mumbai

In [ ]:
data[0:3] # By default it uses iloc

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       M   Mumbai      F          yellow

In [ ]:
df = pd.DataFrame({"Key":[22,33,21,34,24,13,13,434,545,676]}, index = [10,9,5,7,6,54,4,3,2,1])
df

    Key
10   22
9    33
5    21
7    34
6    24
54   13
4    13
3   434
2   545
1   676

In [ ]:
df.iloc[0:3]

    Key
10   22
9    33
5    21

In [ ]:
df.loc[0:3]

KeyError: ignored

In [ ]:
df.loc[10:54]

    Key
10   22
9    33
5    21
7    34
6    24
54   13